{"compress":true,"commitItems":[["6f508905-efc4-4caa-b857-55bf48e3a4b0",1533810158077,"",[[1533810125659,["ethankw@Ethans-MacBook.local",[[1,0,"# Account   账户\n\n\n"]],[0,0],[17,17]]],[1533810151507,["ethankw@Ethans-MacBook.local",[[-1,0,"# Account   账户\n\n\n"]],[0,17],[0,0]]],[1533810152235,["ethankw@Ethans-MacBook.local",[[1,0,"\n\n"]],[0,0],[1,1]]],[1533810152784,["ethankw@Ethans-MacBook.local",[[-1,1,"\n"]],[1,1],[0,0]]],[1533810153673,["ethankw@Ethans-MacBook.local",[[1,0,"# Overview\n\nThere are several types of account in LesQueers platform. Currently we have:\n\n* [Personal Account | 个人账户](#)(Personal Account | 个人账户)\n* [Business Account | 商家账户](#)(Business Account | 商家账户)\n* [Organization Account | 组织账户](#)(Organization Account | 组织账户)\n* [Official Account | 官方账户](#)(Official Account | 官方账户)\n\nUsers can create any type of account on the App, except the `Official Account`. Here is the guide for which account the user should choose to create.\n\n# Personal Account\n\n* For individual usage, you should register a `Personal Account`, which we usually just call it `Account | 账户` in the LQ App. \n\n* After registered, you can request to be marked as a `Verified` if you are a KOL (Key opinion leader) or talent (Artist, Singer, Painter, DJ, etc.). After been approved by us, there will be a small talent icon shows right after your display name. Other users can always see it, they can also check your verification information. \n\n* The verification of an account can be also removed by official management team, for if you break our user agreement or other reasons.\n\n# Business Account\n\n* If you are the owner/manager of a business, such as a shop, coffee shop, restaurant, bar, club or any kind of online business, you should register a `Business Account`.\n\n* We provide some useful tools/features to help you promote your business. You can also easily connect with your customers who are also LesQueers users.\n\n# Organization Account\n\n* If you are the owner/manager of a group, salon, community, NGO, salon or any kind of organization, you should register an `Organization Account`.\n\n* We provide some useful tools/features to help you promote your organization. You can also easily connect with your members who are also LesQueers users.\n\n> > > \n\n# Official Account\n\n* It can be only create by LQ crews through our background management platform.\n\n* There is a small official icon shows right after the display name of an `Official Account`, to make sure that users can recognize and won’t be scammed by fake official accounts.\n\n* LQ team can create as many as official accounts we want to use them in different usages, such as `LQ Event`, `LQ Key`, `LQ Training`.\n\n* Official account is just a special version of personal account, so it can use all functions of personal account."]],[0,0],[2307,2307]]]],null,"ethankw@Ethans-MacBook.local"]]}