{"compress":true,"commitItems":[["b11e14df-237f-45f7-ae88-1bd3f1ff07e8",1533799051275,"",[[1533799042888,["ethankw@Ethans-MacBook.local",[[1,0,"# Welcome to LesQueers Wiki!\n\n>>>\n\nThis wiki is created for share all product documents for the `Rebuild LQ App`. If you have any question please fell free to contact Ethan.\n\n* WeChat: `ethankw`\n* Mobile: `+(86) 186 2183 1305`\n* Email: `ethan@lesqueers.com`\n\n>>>\n\n\n# Index\n\n* [Account | 账户](Account | 账户)\n\n# What are the most big changes in the rebuild App?\n\nThere are some systems were been designed in a unprofessional way. So we will improve or redesign them in the new App.\n\n## Big changes in the new App\n\n### Interface Language\n\n* For the first time launch, interface language setting will be automatically done. Depends on user’s language setting of his/her system, LQ App will launched as the same language. If user’s system language is not in our language list, then make it in English.\n\n* Users can always change interface language of LQ App in the Setting page. After this setup by user, in the future, whatever system language is, LQ App will display the language he/she setup.\n\n### Register & Login\n\n* All `Register`, `Login`, `Reset Password` workflows are brand new designed.\n\n* In the new register workflow, all kind of accounts will be registered with `Phone Number` as their default login credential. They are also requested to setup a `Username` and `Password`. So all users can login with username and password too.\n\n* In the new register workflow, all kind of accounts will be asked for `Email Address`, and we will send an email contains a verification link. If the user verified his/her email address, then he/she can also login with `Email Address` and `Password`. Also we will send emails with many kind of notifications. If the user doesn’t verified it, then he couldn’t login with email, also won’t receive any notification emails except big announcements.\n\n* We will also provide options to let users can registered with third party SSO (Single Sign On) Services such as Facebook and Twitter in the future.\n\n### User Relationship\n\n* In the old App, user relationship is like WeChat, it’s a `Friend` mode to let users can easily communicate with whom they already know each other. But in the new App, we will change it to `Follow` mode like Instagram, to encourage users make more activities with strangers.\n\n* All posts our users created are public to everyone.\n\n* Whether User A and B have followed each other or not, they can always send message to each other. But if they haven’t followed each other, the user who send message can only send one message per day, the user who received the message can always choose if he/she wants to receive more from this user in the future, or not (the one who send message couldn’t send more in the future)."]],[0,0],[2673,2673]]]],null,"ethankw@Ethans-MacBook.local"]]}